# Модуль `datetime` в Python предоставляет возможности для работы
# с датами и временем.
# Основные возможности модуля datetime:
# `datetime.date` — Представляет дату (год, месяц, день) без времени.
# `datetime.time` — Представляет время, независимо от даты.
# `datetime.datetime` — Комбинация даты и времени.

import datetime # Импорт модуля datetime

# datetime.now().isoformat() для ISO

t = datetime.datetime.now() # командой выводит текущую дату и время
print("Текущее время :", t) # Вывод: Текущее время : 2026-09-20 17:39:42.309311

d = datetime.date.today() # командой выводит текущую дату
print("Текущая дата:", d) # Вывод: Текущая дата: 2026-09-20

d = datetime.date.today()
date = d.strftime("%d %B %Y")        # метод, который форматируют текущую дату
date = d.strftime("%d. %m. %Yг.")        # другой формат
print("Форматированная дата:", date) # Вывод: Форматированная дата: 20 September 2026
                                     # Вывод другой формат: 20. 09. 2026г.

# Коды форматирования:
# Код	    Значение        	                Пример
# %Y	    Год (4 цифры)	                    2026
# %y	    Год (2 цифры)	                    26
# %m	    Месяц (01–12)	                    09
# %B	    Полное название месяца	            September
# %b	    Сокращённое название месяца	        Sep
# %d	    День месяца                         (01–31)	20
# %A	    Полное название дня недели	        Sunday
# %a	    Сокращённое название дня недели	    Sun
# %H	    Часы (00–23)                    	14
# %I	    Часы (01–12)                    	02
# %M	    Минуты (00–59)                  	30
# %S	    Секунды (00–59)                 	45
# %f	    Микросекунды (6 цифр)           	123456
# %p	    AM/PM	                            PM
# %j	    День года                           (001–366)	263
# %U	    Номер недели (воскресенье — первый день)	37
# %W	    Номер недели (понедельник — первый день)	37
# %z	    Смещение UTC	                    +0300
# %Z	    Название часового пояса	            MSK
# %%	    Символ %	                        %

# ISO 8601 — универсальный формат:
# Самый надёжный и переносимый способ хранения даты/времени:
# 2026-09-20T14:30:45+03:00
# 2026-09-20T14:30:45Z        (UTC)
# 2026-09-20                  (только дата)

# В большинстве языков есть готовая функция для ISO-формата:
# Python: datetime.now().isoformat()



